<a href="https://colab.research.google.com/github/alekhaya99/Pandas_Tutorial/blob/master/Pandas_Tutorial_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Some Important Fuctionality

In [1]:
import pandas as pd
import numpy as np

In [2]:
object=pd.Series([10,5,20,-9,72],index=['a','b','c','d','e'])
object

a    10
b     5
c    20
d    -9
e    72
dtype: int64

In [3]:
#In order to reindex the pandas Series
object1=object.reindex(['a','b','c','d','e','f'])
object1

a    10.0
b     5.0
c    20.0
d    -9.0
e    72.0
f     NaN
dtype: float64

In [4]:
Object2=pd.Series(['blue','purple','yellow'],index=[0,2,4])
Object2

0      blue
2    purple
4    yellow
dtype: object

In [5]:
#Inorder to reindex and fill up the empty value
Object2.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [6]:
Object_DataFrame=pd.DataFrame(np.arange(16).reshape((4,4)),index=['a','b','c','d'],columns=['A','B','C','D'])
Object_DataFrame

    A   B   C   D
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [7]:
Object_DataFrame1=Object_DataFrame.reindex(['a','b','c','d','e'])
Object_DataFrame1

      A     B     C     D
a   0.0   1.0   2.0   3.0
b   4.0   5.0   6.0   7.0
c   8.0   9.0  10.0  11.0
d  12.0  13.0  14.0  15.0
e   NaN   NaN   NaN   NaN

In [8]:
alphabets=['A','E','D']
Object_DataFrame.reindex(columns=alphabets)

    A   E   D
a   0 NaN   3
b   4 NaN   7
c   8 NaN  11
d  12 NaN  15

# pandas.DataFrame.reindex


According to https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.reindex.html 
1.   **keywords for axes :array-like, optional**
*   New labels / index to conform to, should be specified using keywords. Preferably an Index object to avoid duplicating data.
2. ** method{None, ‘backfill’/’bfill’, ‘pad’/’ffill’, ‘nearest’}**


*   Method to use for filling holes in reindexed DataFrame. Please note: this is only applicable to DataFrames/Series with a monotonically increasing/decreasing index.

None (default): don’t fill gaps

pad / ffill: Propagate last valid observation forward to next valid.

backfill / bfill: Use next valid observation to fill gap.

nearest: Use nearest valid observations to fill gap. *italicised text*
*  copybool: default True


3.   **copybool: default True**


*   Return a new object, even if the passed indexes are the same.
*   List item


4.  **level: int or name**

*   Broadcast across a level, matching Index values on the passed MultiIndex level.


5.   **fill_value :scalar, default np.NaN**

* Value to use for missing values. Defaults to NaN, but can be any “compatible” value.  

6. **limit: int, default None**
*   Maximum number of consecutive elements to forward or backward fill.


7.   **tolerance: optional**


*   Maximum distance between original and new labels for inexact matches. The values of the index at the matching locations most satisfy the equation abs(index[indexer] - target) <= tolerance.

Tolerance may be a scalar value, which applies the same tolerance to all values, or list-like, which applies variable tolerance per element. List-like includes list, tuple, array, Series, and must be the same size as the index and its dtype must exactly match the index’s type.

# Dropping entries from an Axis

In [9]:
Object_3=pd.Series(np.arange(1,4),index=['a','b','c'])
Object_3

a    1
b    2
c    3
dtype: int64

In [10]:
#In order to remove the item from the Pandas Series
New_Object_3=Object_3.drop('a')
New_Object_3

b    2
c    3
dtype: int64

In [11]:
New_Object_3.drop(['b','c'])

Series([], dtype: int64)

In [12]:
Object_3.drop('c',inplace=True)
Object_3

a    1
b    2
dtype: int64

In [13]:
#Using with Data Frame
Object_DataFrame2=pd.DataFrame(np.arange(9).reshape((3,3)),index=['a','b','c'],columns=['A','B','C'],)
Object_DataFrame2.index.name='small';Object_DataFrame2.columns.name='LARGE'
Object_DataFrame2

LARGE  A  B  C
small
a      0  1  2
b      3  4  5
c      6  7  8

In [14]:
#Removes the values along the row
Object_DataFrame2.drop(['a'])

LARGE  A  B  C
small
b      3  4  5
c      6  7  8

In [15]:
#Remove the values along the column
Object_DataFrame2.drop('A',axis=1)

LARGE  B  C
small
a      1  2
b      4  5
c      7  8

In [16]:
#Alternative method to remove the values along the column
Object_DataFrame2.drop('B',axis='columns')

LARGE  A  C
small
a      0  2
b      3  5
c      6  8

# Indexing, Selection & Filtering

In [17]:
i=1
Object_4=pd.Series(np.arange(i,i+4),index=['a','b','c','d'])
Object_4

a    1
b    2
c    3
d    4
dtype: int64

In [18]:
Object_4['a']

1

In [19]:
Object_4[0]

1

In [20]:
Object_4[0:3]

a    1
b    2
c    3
dtype: int64

In [21]:
Object_4[['a','b']]

a    1
b    2
dtype: int64

In [22]:
Object_4[[0,2]]

a    1
c    3
dtype: int64

In [23]:
Object_4[Object_4>9]

Series([], dtype: int64)

In [24]:
Object_4['a':'d']

a    1
b    2
c    3
d    4
dtype: int64

In [25]:
Object_4['a':'d']='Same Value'
Object_4

a    Same Value
b    Same Value
c    Same Value
d    Same Value
dtype: object

In [26]:
Object_DataFrame3=pd.DataFrame(np.arange(25).reshape((5,5)),index=['a','b','c','d','e'],columns=['A','B','C','D','E'],)
Object_DataFrame3.index.name='small';Object_DataFrame2.columns.name='LARGE'
Object_DataFrame3

        A   B   C   D   E
small
a       0   1   2   3   4
b       5   6   7   8   9
c      10  11  12  13  14
d      15  16  17  18  19
e      20  21  22  23  24

In [27]:
Object_DataFrame3['E']

small
a     4
b     9
c    14
d    19
e    24
Name: E, dtype: int64

In [28]:
Object_DataFrame3[1:4]

        A   B   C   D   E
small
b       5   6   7   8   9
c      10  11  12  13  14
d      15  16  17  18  19

In [29]:
Object_DataFrame3[Object_DataFrame3['E']>=8]

        A   B   C   D   E
small
b       5   6   7   8   9
c      10  11  12  13  14
d      15  16  17  18  19
e      20  21  22  23  24

In [30]:
Object_DataFrame3<=10

           A      B      C      D      E
small
a       True   True   True   True   True
b       True   True   True   True   True
c       True  False  False  False  False
d      False  False  False  False  False
e      False  False  False  False  False

In [31]:
Object_DataFrame3[Object_DataFrame3<=10]='I changed the value'

In [32]:
Object_DataFrame3

                         A  ...                    E
small                       ...
a      I changed the value  ...  I changed the value
b      I changed the value  ...  I changed the value
c      I changed the value  ...                   14
d                       15  ...                   19
e                       20  ...                   24

[5 rows x 5 columns]

# loc & iloc selection

In [33]:
#Enable to select a subset of rows and columns from axis label
Object_DataFrame3.loc['a',['A','B']]

A    I changed the value
B    I changed the value
Name: a, dtype: object

In [34]:
#Enable to select a subset of rows and columns from integers
Object_DataFrame3.iloc[4,[1,0,2]]

B    21
A    20
C    22
Name: e, dtype: object

In [35]:
Object_DataFrame3.iloc[4]

A    20
B    21
C    22
D    23
E    24
Name: e, dtype: object

In [36]:
Object_DataFrame3.iloc[[0,1],[1,2,3,4]]

                         B  ...                    E
small                       ...
a      I changed the value  ...  I changed the value
b      I changed the value  ...  I changed the value

[2 rows x 4 columns]

In [37]:
Object_DataFrame3.loc[:'c','C']

small
a    I changed the value
b    I changed the value
c                     12
Name: C, dtype: object

# Indexing Options with DataFrame

In [38]:
#Select single column or sequence of columns from the Data Frame
Object_DataFrame3['A']

small
a    I changed the value
b    I changed the value
c    I changed the value
d                     15
e                     20
Name: A, dtype: object

In [39]:
#Selects single row or subsets of rows from the DataFrame by label
Object_DataFrame3.loc['a']

A    I changed the value
B    I changed the value
C    I changed the value
D    I changed the value
E    I changed the value
Name: a, dtype: object

In [40]:
#Select single coloumn or subset of columns by label
Object_DataFrame3.loc[:'d','A']

small
a    I changed the value
b    I changed the value
c    I changed the value
d                     15
Name: A, dtype: object

In [41]:
#Select both rows and columns by label
Object_DataFrame3.loc['a','A']

'I changed the value'

In [42]:
#Select single row or subset of rows from the DataFrame by integer position
Object_DataFrame3.iloc[1]

A    I changed the value
B    I changed the value
C    I changed the value
D    I changed the value
E    I changed the value
Name: b, dtype: object

In [43]:
#Selects single column or subset of column by integer position
Object_DataFrame3.iloc[:,0]

small
a    I changed the value
b    I changed the value
c    I changed the value
d                     15
e                     20
Name: A, dtype: object

In [44]:

#Select both rows and column by integer position
Object_DataFrame3.iloc[1,1]

'I changed the value'

In [45]:
#Selects a single scalar value by rows and column label
Object_DataFrame3.at['a','A']

'I changed the value'

In [46]:
#selects a singular scalar value by rows and column position
Object_DataFrame3.iat[0,2]

'I changed the value'

In [47]:
#Selected either rows or column by labels
Object_DataFrame3.reindex

<bound method DataFrame.reindex of                          A  ...                    E
small                       ...
a      I changed the value  ...  I changed the value
b      I changed the value  ...  I changed the value
c      I changed the value  ...                   14
d                       15  ...                   19
e                       20  ...                   24

[5 rows x 5 columns]>

# Aritmetic & Data Alignment

In [48]:
Series=pd.Series(np.arange(10))
Series

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [49]:
Series1=pd.Series([1,2,3,4,5],index=['A','B',"C",'D','E'])
Series2=pd.Series([6,7,8,9,10],index=['F','G',"H",'I','J'])

In [50]:
Series1

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [51]:
Series2

F     6
G     7
H     8
I     9
J    10
dtype: int64

In [52]:
Series1+Series2

A   NaN
B   NaN
C   NaN
D   NaN
E   NaN
F   NaN
G   NaN
H   NaN
I   NaN
J   NaN
dtype: float64

In [53]:
Series3=pd.Series([1,2,3,4,5],index=['A','B',"C",'D','E'])
Series4=pd.Series([6,7,8,9,10],index=['A','B',"C",'D','E'])

In [54]:
Series3

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [55]:
Series4

A     6
B     7
C     8
D     9
E    10
dtype: int64

In [56]:
Series3+Series4

A     7
B     9
C    11
D    13
E    15
dtype: int64

In [57]:
Data_Frame1=pd.DataFrame(np.arange(16).reshape((4,4)),columns=list('abcd'),index=['A','B','C','D'])
Data_Frame2=pd.DataFrame(np.arange(20).reshape((5,4)),columns=list('abcd'),index=['A','B','C','D','E'])

In [58]:
Data_Frame1+Data_Frame2

      a     b     c     d
A   0.0   2.0   4.0   6.0
B   8.0  10.0  12.0  14.0
C  16.0  18.0  20.0  22.0
D  24.0  26.0  28.0  30.0
E   NaN   NaN   NaN   NaN

In [59]:
Data_Frame2.loc['A','b']=np.nan
Data_Frame2

    a     b   c   d
A   0   NaN   2   3
B   4   5.0   6   7
C   8   9.0  10  11
D  12  13.0  14  15
E  16  17.0  18  19

In [60]:
#In order to fil the NaN with some other values
Data_Frame1.add(Data_Frame2,fill_value=1)

      a     b     c     d
A   0.0   2.0   4.0   6.0
B   8.0  10.0  12.0  14.0
C  16.0  18.0  20.0  22.0
D  24.0  26.0  28.0  30.0
E  17.0  18.0  19.0  20.0

In [61]:
1/Data_Frame1

          a         b         c         d
A       inf  1.000000  0.500000  0.333333
B  0.250000  0.200000  0.166667  0.142857
C  0.125000  0.111111  0.100000  0.090909
D  0.083333  0.076923  0.071429  0.066667

In [62]:
#This will produce the same result like the previous expression i.e. Divide one with the DataFrame
Data_Frame1.rdiv(1)

          a         b         c         d
A       inf  1.000000  0.500000  0.333333
B  0.250000  0.200000  0.166667  0.142857
C  0.125000  0.111111  0.100000  0.090909
D  0.083333  0.076923  0.071429  0.066667

In [63]:
#Reindexing of data Frame
Data_Frame1.reindex(columns=Data_Frame2.columns ,fill_value=1)

    a   b   c   d
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15

In [64]:
#Alteranative method for adding
Data_Frame1.radd(Data_Frame2)

      a     b     c     d
A   0.0   NaN   4.0   6.0
B   8.0  10.0  12.0  14.0
C  16.0  18.0  20.0  22.0
D  24.0  26.0  28.0  30.0
E   NaN   NaN   NaN   NaN

In [65]:
#Alternative method of subtraction
Data_Frame1.rsub(Data_Frame2)

     a    b    c    d
A  0.0  NaN  0.0  0.0
B  0.0  0.0  0.0  0.0
C  0.0  0.0  0.0  0.0
D  0.0  0.0  0.0  0.0
E  NaN  NaN  NaN  NaN

In [66]:
'''In mathematics and computer science, 
the floor function is the function that takes as input a real number,
 and gives as output the greatest integer less than or equal to, denoted, or. '''
 #Method for Floor Division (//)
Data_Frame1.rfloordiv(Data_Frame2)

     a    b    c    d
A  NaN  NaN  1.0  1.0
B  1.0  1.0  1.0  1.0
C  1.0  1.0  1.0  1.0
D  1.0  1.0  1.0  1.0
E  NaN  NaN  NaN  NaN

In [67]:
#Method for multiplication
Data_Frame1.rmul(Data_Frame2)

       a      b      c      d
A    0.0    NaN    4.0    9.0
B   16.0   25.0   36.0   49.0
C   64.0   81.0  100.0  121.0
D  144.0  169.0  196.0  225.0
E    NaN    NaN    NaN    NaN

In [68]:
#Methods for expotential
Data_Frame1.rpow(2)

      a     b      c      d
A     1     2      4      8
B    16    32     64    128
C   256   512   1024   2048
D  4096  8192  16384  32768

# Operations between Dataframe and Series

In [69]:
Data_Frame3=pd.DataFrame(np.arange(15).reshape((5,3)),columns=list('abc'),index=['A','B','C','D','E'])
Data_Frame3

    a   b   c
A   0   1   2
B   3   4   5
C   6   7   8
D   9  10  11
E  12  13  14

In [70]:
Series5=Data_Frame3.iloc[0]
Series5

a    0
b    1
c    2
Name: A, dtype: int64

In [71]:
#Subtraction operations down the row
Data_Frame3-Series5

    a   b   c
A   0   0   0
B   3   3   3
C   6   6   6
D   9   9   9
E  12  12  12

In [72]:
Series6=pd.Series(range(5),index=['a','c','d','e','f'])
Series6

a    0
c    1
d    2
e    3
f    4
dtype: int64

In [73]:
#If there are unmatched index, then NaN will appear
Data_Frame3+Series6

      a   b     c   d   e   f
A   0.0 NaN   3.0 NaN NaN NaN
B   3.0 NaN   6.0 NaN NaN NaN
C   6.0 NaN   9.0 NaN NaN NaN
D   9.0 NaN  12.0 NaN NaN NaN
E  12.0 NaN  15.0 NaN NaN NaN

In [74]:
#Copy a particular column to the Series
Series7=Data_Frame3['a']
Series7

A     0
B     3
C     6
D     9
E    12
Name: a, dtype: int64

In [75]:
Data_Frame3.sub(Series7,axis='index')

   a  b  c
A  0  1  2
B  0  1  2
C  0  1  2
D  0  1  2
E  0  1  2

In [76]:
Data_Frame3.sub(Series7,axis=0)

   a  b  c
A  0  1  2
B  0  1  2
C  0  1  2
D  0  1  2
E  0  1  2

# Function Application and Mapping

In [77]:
Data_Frame4=pd.DataFrame(np.random.rand(5,5),columns=list('abcde'),index=['A','B','C','D','E'])
Data_Frame4

          a         b         c         d         e
A  0.266853  0.624441  0.503122  0.033838  0.934691
B  0.191640  0.133239  0.534466  0.877994  0.910252
C  0.618975  0.640772  0.960896  0.472402  0.999789
D  0.052133  0.580819  0.006032  0.087438  0.673438
E  0.812763  0.664541  0.553207  0.125903  0.109717

In [78]:
#Produces absolute values
np.abs(Data_Frame4)

          a         b         c         d         e
A  0.266853  0.624441  0.503122  0.033838  0.934691
B  0.191640  0.133239  0.534466  0.877994  0.910252
C  0.618975  0.640772  0.960896  0.472402  0.999789
D  0.052133  0.580819  0.006032  0.087438  0.673438
E  0.812763  0.664541  0.553207  0.125903  0.109717

In [79]:
#Lambda function
Lambda_function=lambda z: z.max()-z.min()

In [80]:
#Apply the Lambda function down the row of the Data Frame
Data_Frame4.apply(Lambda_function)

a    0.760630
b    0.531302
c    0.954864
d    0.844157
e    0.890072
dtype: float64

In [81]:
#Apply the Lambda function across the row of the Data Frame
Data_Frame4.apply(Lambda_function,axis=1)

A    0.900853
B    0.777013
C    0.527387
D    0.667406
E    0.703046
dtype: float64

In [82]:
#Computes the max and min value for the Data_Frame across the row
def Function(z):
  return pd.Series([z.min(),z.max()],index=['min','max'])

Data_Frame4.apply(Function)

            a         b         c         d         e
min  0.052133  0.133239  0.006032  0.033838  0.109717
max  0.812763  0.664541  0.960896  0.877994  0.999789

In [83]:
#In order to the convert the floating numbers into two secimal places
Format=lambda x:'%.2f'%x
Data_Frame4.applymap(Format)

      a     b     c     d     e
A  0.27  0.62  0.50  0.03  0.93
B  0.19  0.13  0.53  0.88  0.91
C  0.62  0.64  0.96  0.47  1.00
D  0.05  0.58  0.01  0.09  0.67
E  0.81  0.66  0.55  0.13  0.11

In [84]:
Data_Frame4['e'].map(Format)

A    0.93
B    0.91
C    1.00
D    0.67
E    0.11
Name: e, dtype: object

#Sorting and ranking

In [85]:
Object_5=pd.Series(range(0,5),index=['A','B','D','C','E'])
Object_5

A    0
B    1
D    2
C    3
E    4
dtype: int64

In [86]:
#For sorting the series
Object_5.sort_index()

A    0
B    1
C    3
D    2
E    4
dtype: int64

In [87]:
Data_Frame5=pd.DataFrame(np.arange(6).reshape((2,3)),index=['B','A'],columns=['c','b','a'])
Data_Frame5

   c  b  a
B  0  1  2
A  3  4  5

In [88]:
#Soerting in Data_Frame
Data_Frame5.sort_index()

   c  b  a
A  3  4  5
B  0  1  2

In [89]:
#Sorting of DataFrame in column
Data_Frame5.sort_index(axis=1)

   a  b  c
B  2  1  0
A  5  4  3

In [90]:
#Sorting of DataFrame in column in descending order
Data_Frame5.sort_index(axis=1,ascending=False)

   c  b  a
B  0  1  2
A  3  4  5

In [91]:
Object_6=pd.Series([1,-1,2,-2])
Object_6

0    1
1   -1
2    2
3   -2
dtype: int64

In [92]:
#In order to sort the values, the missing values will be sorted at the end
Object_6.sort_values()

3   -2
1   -1
0    1
2    2
dtype: int64

In [93]:
#In order to sort the values for a particular column
Data_Frame5.sort_values(by='a')

   c  b  a
B  0  1  2
A  3  4  5

In [94]:
Data_Frame5.sort_values(by=['a','b'])

   c  b  a
B  0  1  2
A  3  4  5

In [95]:
Object_7=pd.Series([7,-5,7,4,2,0,4])
Object_7

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [96]:
#This is same like the average method and a default method, it assigns the average rank to each entry in the equal group
Object_7.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [97]:
#Assign ranks in order the value appears in data
Object_7.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [98]:
#Default method,it assigns the average rank to each entry in the equal group 
Object_7.rank(method='average')

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [99]:
#Use minimum rank for the whole rank
Object_7.rank(method='min')

0    6.0
1    1.0
2    6.0
3    4.0
4    3.0
5    2.0
6    4.0
dtype: float64

In [100]:
#Use maximum rank for the whole group
Object_7.rank(method='max')

0    7.0
1    1.0
2    7.0
3    5.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [101]:

Object_7.rank(method='dense')

0    5.0
1    1.0
2    5.0
3    4.0
4    3.0
5    2.0
6    4.0
dtype: float64